Revit 2023 API
StructuralSettings.SymbolicCutbackForColumn Property
 Symbolic cutback distance to be applied to all columns.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2011
Syntax
C#
public double SymbolicCutbackForColumn { get; set; }
Visual Basic
Public Property SymbolicCutbackForColumn As Double
	Get
	Set
Visual C++
public:
property double SymbolicCutbackForColumn {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace